# repos
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'aws/tap'

# macOS programs I typically use, subject to change
cask '1password'
cask 'alacritty'
cask 'obsidian'
cask 'orion'
cask 'discord'
cask 'docker'
cask 'font-fira-code'
cask 'insomnia'
cask 'karabiner-elements'
cask 'rectangle'

# uncomment if work machine
# cask 'lastpass'
# cask 'slack'
# cask 'zoomus'

# core stuff
brew 'fish'
brew 'git'
brew 'neovim'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'yadm'
brew 'zellij'

# less core stuff but I use these regularly enough
brew 'bat'
brew 'coreutils'
brew 'editorconfig-checker'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'lf'
brew 'rg'
brew 'trash'

# languages
brew 'gcc'
brew 'golang'
brew 'jsonnet'
brew 'node'
brew 'nvm'
brew 'terraform'
brew 'zig'

# core cloud stuff
brew 'aws-vault'
